<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html><head><title>Criando Intranet com serviços básicos</title>
<meta http-equiv="Content-Language" content="pt-br">
<meta content="MSHTML 6.00.2900.2722" name="GENERATOR">
<meta content="FrontPage.Editor.Document" name="ProgId">
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252"></head>

<body>
<p><font color="#0000ff" size="5">Implementando uma Intranet</font></p>
<p>O objetivo desta atividade &eacute; construir uma intranet com os principais servi&ccedil;os 
  de rede. Neste caso, o aluno ter&aacute; que configurar os servi&ccedil;os b&aacute;sicos 
  DHCP, DNS, SMTP e WWW e demonstrar conhecimento sobre as funcionalidades e sobre 
  a teoria envolvida na concep&ccedil;&atilde;o desses protocolos.</p>
<p><font color="#0000ff" size="5">Os servi&ccedil;os b&aacute;sicos</font></p>
<p>Abaixo est&atilde;o os links para cada um dos servi&ccedil;os b&aacute;sicos:</p>
<table border="1">
  <tbody>
    <tr> 
      <td width="12%">Servi&ccedil;o DHCP</td>
      <td width="88%">Os alunos dever&atilde;o preparar um servidor DHCP para oferecer endere&ccedil;os 
        IP dinamicamente para uma esta&ccedil;&atilde;o cliente na sua pr&oacute;pria 
        bancada. A prepara&ccedil;&atilde;o deste servi&ccedil;o deve seguir as 
        regras e entrega do relat&oacute;rio que est&aacute; <a href="FRC_ROTEIRO_DHCP.pdf">neste 
        link</a>. Al&eacute;m disso, devem ler sobre a parte te&oacute;rica deste 
        assunto no Tanenbaum.</td>
    </tr>
    <tr> 
      <td width="12%">Servi&ccedil;o DNS</td>
      <td>Os alunos dever&atilde;o preparar um servidor DNS para traduzir nomes 
        para as esta&ccedil;&otilde;es da empresa. A prepara&ccedil;&atilde;o 
        deste servi&ccedil;o deve seguir o roteiro que est&aacute; dispon&iacute;vel 
        <a href="FRC_ROTEIRO_DNS.pdf">neste link</a>. Al&eacute;m disso, 
        devem ler a parte te&oacute;rica sobre esse servi&ccedil;o no Tanenbaum 
        (&iacute;tem 7.1 da 4&ordf; edi&ccedil;&atilde;o ou &iacute;tem 7.2 da 
        3&ordf; edi&ccedil;&atilde;o).</td>
    </tr>
    <tr> 
      <td width="12%">Servi&ccedil;o SMTP</td>
      <td>Os alunos dever&atilde;o preparar um servidor de e-mails SMTP PostFix 
        com acesso de e-mails via local e POP, seguindo as dicas b&aacute;sicas 
        e respondendo as perguntas que est&atilde;o <a href="FRC_ROTEIRO_SMTP.pdf">neste 
        roteiro</a>. Al&eacute;m disso, devem ler a parte te&oacute;rica sobre 
        esse servi&ccedil;o no Tanenbaum (&iacute;tem 7.2 da 4&ordf; edi&ccedil;&atilde;o 
        ou &iacute;tem 7.4 da 3&ordf; edi&ccedil;&atilde;o).</td>
    </tr>
    <tr>
      <td>Servi&ccedil;o WWW</td>
      <td>Os alunos dever&atilde;o reconfigurar o servidor WWW seguindo as dicas 
        e respondendo as quest&otilde;es que est&atilde;o <a href="FRC_ROTEIRO_WEB.pdf">neste 
        roteiro</a>. Al&eacute;m disso, devem ler a parte te&oacute;rica sobre 
        esse servi&ccedil;o no Tanenbaum (&iacute;tem 7.3 da 4&ordf; edi&ccedil;&atilde;o 
        ou &iacute;tem 7.6 da 3&ordf; edi&ccedil;&atilde;o).</td>
    </tr>
  </tbody>
</table>
<p><font color="#0000ff" size="5">Regras de apresenta&ccedil;&atilde;o</font></p>
<ul>
  <li> 
    <p align="left">O trabalho deve ser feito em grupos de 3 ou 4 alunos, para 
      ser entregue e apresentado em 30/01/2023.</p>
  </li>
  <li> 
    <p align="left">O grupo deve entregar um relat&oacute;rio (postado no Moodle e como pagina web) , contendo: </p>
    <ul>
      <li> 
        <p align="left">Nome fict&iacute;cio da empresa</p>
      </li>
      <li> 
        <p align="left">Nomes dos funcion&aacute;rios (membros do grupo) e e-mail.</p>
      </li>
      <li> 
        <p align="left">Nome do dom&iacute;nio escolhido (Ex.: frc.com.br)</p>
      </li>
      <li> 
        <p align="left">Classe de endere&ccedil;amento assumida (por exemplo, 192.168.10.0, 172.25.0.0 ou 10.0.0.0).</p>
      </li>
      <li> 
        <p align="left">Dados sobre a tabela de rota e regras de NAT do roteador (por exemplo, veja https://www.netfilter.org/documentation/HOWTO/pt/NAT-HOWTO-6.html) da intranet para permitir que os hosts da intranet possam acessar a Internet.</p>
      </li>

      <li> 
        <p align="left">Mapa da rede: um desenho especificando os segmentos de 
          rede e quais os endere&ccedil;os dos computadores onde os servi&ccedil;os 
          est&atilde;o instalados. Nesse caso, incluir tamb&eacute;m um roteador 
          para acesso &agrave; redes externas &agrave; Intranet.</p>
      </li>
      <li> 
        <p align="left">Roteiro de configura&ccedil;&atilde;o para cada um dos 
          servi&ccedil;os solicitados</p>
      </li>
      <li> 
        <p align="left">Respostas para as quest&otilde;es colocadas em cada roteiro. 
          Essas respostas devem fazer parte da home page principal do grupo, instalado 
          no servidor web. </p>
      </li>
    </ul>
  </li>
</ul>
<ul>
  <li> 
    <p align="left">O grupo deve entregar um relat&oacute;rio sobre o experimento, contendo opiniao de cada membro 
      explicando as dificuldades encontradas, a parte que mais participaram no projeto e uma opini&atilde;o pessoal sobre o trabalho. Esses dados devem 
      fazer parte da p&aacute;gina web que estar&aacute; disponibilizada no dom&iacute;nio 
      virtual do aluno, conforme roteiro sobre servidor Web.</p>
  </li>
  <li> 
    <p align="left">Os grupos devem apresentar os servi&ccedil;os funcionando 
      no laborat&oacute;rio. </p>
  </li>
  <li> 
    <p align="left">Os alunos de cada grupo devem vir preparados para responder 
      eventuais quest&otilde;es sobre os servi&ccedil;os apresentados. </p>
  </li>
  <li> 
    <p align="left">AVISOS IMPORTANTES: </p>
    <ul>
      <li>A avalia&ccedil;&atilde;o ser&aacute; feita exclusivamente na data marcada 
        e os alunos que n&atilde;o estiverem presentes no dia da apresenta&ccedil;&atilde;o 
        ser&atilde;o avaliados parcialmente. Al&eacute;m disso, a participa&ccedil;&atilde;o 
        nas fases intermedi&aacute;rias do trabalho podem ser utilizadas como 
        par&acirc;metro para a nota final do trabalho.</li>
      <li>A avalia&ccedil;&atilde;o sobre os servi&ccedil;os apresentados &eacute; 
        individual. Portanto, os alunos devem demonstrar envolvimento e conhecimento 
        sobre o que est&aacute; sendo apresentado pelo grupo para n&atilde;o ficarem 
        prejudicados nas notas. </li>
    </ul>
  </li>
</ul>
<p><font color="#0000ff" size="5">Referencias</font></p>
<p align="left">TANENBAUM, A. (1996). Computer Networks. 3a. Edi&ccedil;&atilde;o, 
  Prentice Hall.</p>
</body></html>